// 23.07.26

// Здесь будут исходные наборы слов, цифр и прочего для работы генератора текста


let textChunk = 'В варианте с кириллицей уже некуда применить. Пойдём другим путём. Получим любой символ из некоторого диапазона кодов и удалим ненужные. Что-то наподобие решета Эратосфена. Понятно, что каждое удаление вычисленного случайного символа записывается в пассив, поэтому, чем больший процент удалений, тем медленнее алгоритм и тем сильнее он будет проигрывать классике [ 3 ]. Оптимизировать — легко, если набор символов занимает ограниченный диапазон кодов юникодов. Но в коде тогда появляются проверки и магические числа.';

let numbersChunk = '29 7060 5219 285 7481 6238 5961 3 3154 655';


